[[0.0, [""], "Every number in the puzzle actually represents an English word. There are a lot of 0's - perhaps it's a good idea to find where the non-zero place values are to determine the mapping from numbers to words."], [5.0, [""], "The flavortext also suggests that MATH is represented by 1001003. In general, most words correspond to a unique number, though a number, especially smaller ones, can represent multiple words. (Some words cannot be represented by a number)"], [10.0, [""], "It will be useful to write out the numbers as words (100 --> \"one hundred\"). \r\n\r\nThese written-out numbers are closely related to the words that they represent."], [15.0, [""], "1001003 is written out as ONE MILLION ONE THOUSAND THREE. \"MATH\" is represented by this number."], [20.0, ["giving away the system"], "It's very relevant that \"MATH\" is a subsequence (i.e. you can pick letters and read them out in order) of ONE [M]ILLION ONE THOUS[A]ND [TH]REE."], [25.0, ["giving away the system"], "In particular, 1001003 is the smallest possible positive integer where \"MATH\" is a subsequence. No smaller number works, so therefore MATH corresponds to the number 1001003. Note that we are using short scale notation, and we do not write the word \"and\" between numbers (or else ONE MILLION AND THREE would be smaller)."], [50.0, ["knows system", " needs help with words"], "When computing the minimal numbers of various words, it's useful to keep the following facts in mind: \r\n\r\nJ and K never appear in numbers. Z only appears in ZERO (and thus effectively, never appears) and B only appears in BILLION (and thus can only appear once). A, Q, C, P, and M are also in quite short supply, so the presence of numbers like QUADRILLION, OCTILLION and SEPTILLION are likely indicators that such letters appear."], [55.0, ["knows system"], "It's also helpful to note that the answers to the clues on the right hand side of the equation will have the same initial letter as the variable on the left hand side."], [75.0, [""], "Now that you have the words that answer the clues, you'll need to plug them into the expressions at the bottom, though now you'll need numbers again. You'll need to perform the reverse operation now."], [90.0, ["extract"], "Solve for the expressions and you've got three numbers. Time to find their corresponding words yet again!"], [100.0, ["extract"], "Once you have three words, use the first two words to derive yet another number. The definition is given by the third word."]]