[[0.0, ["Start"], "This puzzle is about Nintendo GameCube trivia. The initial image is a meta puzzle that uses 6 subpuzzles corresponding to the 6 die faces."], [25.0, ["subpuzzle1 start"], "This is a numberlink and the colors refer to Nintendo GameCube console colors."], [25.0, ["subpuzzle2 start"], "This subpuzzle involves looking up unused test maps or test levels for Nintendo GameCube games. For example, I_TestM refers to a test map in The Legend of Zelda: The Wind Waker. A site that may be of aid is https://noclip.website/"], [25.0, ["subpuzzle3 start"], "Each line in this subpuzzle references a specific Nintendo GameCube game's title, but with each word replaced by a synonym. For example, Plumber club sport: frog chair journey is Mario Golf: Toadstool Tour."], [25.0, ["subpuzzle4 start + extraction"], "This puzzle is about commercials for Nintendo GameCube games. To extract, index into the missing word in each quote by the number of words in the quote."], [25.0, ["subpuzzle 5 start"], "Each of these refers to a specific GameCube accessory. The black pixels in the top left extract to a helpful clue phrase."], [25.0, ["subpuzzle6 start / extraction"], "This subpuzzle is about Nintendo GameCube game covers. Each game cover is from a game that is exclusive to Japan (with one exception which is a Japan and Europe exclusive). Extract via the red circled letter on each game cover."], [50.0, ["subpuzzle1 extraction"], "Fill in the full names of each Nintendo GameCube console color along the numberlink paths. Extract the answer for this subpuzzle by reading the letters on top of the numbered squares and ordering by their numbers."], [50.0, ["subpuzzle3 extract"], "For each game, look up the number of memory blocks it uses and convert it alphanumerically to a letter. Some sites that are good references for this are MobyGames or GameSpy."], [50.0, ["subpuzzle5 extraction"], "The top left pixel in each image has a color whose hex value is between 1 and 26 which should be converted numerically."], [100.0, ["meta extraction"], "Each subpuzzle answer is 15 letters long and the metapuzzle's image references the Nintendo GameCube's start up animation.\r\n\r\nThe cube in the start up animation has 15 steps in a specific pattern. Look at the number on the die face that is visible / on top at each step in the animation. Take the appropriate letter from the corresponding subpuzzle's answer."]]