[[0.0, ["start"], "There are some transformations you'll have to discover: for example, if you reverse the order of the vowels in every word in the 17th line, you get a readable clue."], [10.0, ["transformations"], "Some of these sentences look like total gibberish and don't seem like they can be made into normal English sentences with only one simple transformation.\r\n\r\nThe flavortext tells you that there are 9 unique transformations."], [20.0, ["answers"], "If you google the clue answers together, you'll find they share a commonality that lets you match them up with the images in the grid."], [25.0, ["transformations"], "There are 9 transformations, and each of the 20 lines was generated by taking some English clue and applying a subset of these transformations.\r\n\r\nThese transformations have a consistent order, which can be determined using the clues that involve multiple transformations."], [50.0, ["help", " solving clues"], "[help out teams by pointing out mistakes in their clues, or by giving them hints to the transformations they're missing (or just giving the transformations outright). For some of the hardest clues, you can confirm some or all of the transformations they use. I think it's very easy to slightly mistranscribe something, so if a team shares their sheet with you, the most valuable thing you can do is probably verify that their data is correct.]"], [80.0, ["extraction"], "There's a reason that the images were presented in a 5x4 grid (as opposed to just listing all 20 of them in a row)."], [81.0, ["extraction"], "Once you've matched up each clue to a picture, you no longer need to use the names of the Transformers (or the pictures, for that matter)."], [99.0, ["extraction", " heavy"], "For each transformation, shade in all the squares of the 4x5 grid that use that transformation. This will spell out 1 or 2 letters.\r\n\r\nArrange these letters in precedence order of transformation to spell out a final cluephrase."], [100.0, ["transform this"], "Apply all 9 transformations in order to this phrase to get the final answer."]]