[[1.0, ["starting"], "This puzzle is so small! Maybe it's too small to even be forward-solved..."], [2.0, ["stuck"], "When we first opened this round, the meta Rule of Three, was immediately solved, but we never used the information on the meta page. Maybe we can backsolve this puzzle by figuring out how its meta works!"], [25.0, ["giving it away"], "The metapuzzle, Rule of Three, for this round uses the answers to the eight puzzles in this round, including this one. We must figure out how to solve the meta using the answers and the dates on the metapuzzle page to produce the answer GALAXY.\r\n\r\nOnce we've determined that, we can try to determine what the feeder answer corresponding to this puzzle is."], [40.0, ["meta"], "There are eight puzzles in this round. Can we associate each answer with a set of things that is thematic with the art of the round?"], [50.0, [""], "Each answer can be associated with one of the eight planets."], [60.0, ["planets"], "Each of the six dates corresponds to a letter in the metapuzzle's answer GALAXY, in order. Since we've associated each answer with a planet, maybe we should examine the solar system on that exact date?\r\n\r\nRemember that the metapuzzle's name is Rule of Three."], [70.0, ["syzygy"], "On each date there is a planetary syzygy; i.e., there are three planets which are collinear. \r\n\r\nThere are a variety of sites you can use to determine the positions of the planets at a given date and time. We recommend https://mgvez.github.io/jsorrery/."], [70.5, ["orrery"], "There are a variety of sites you can use to determine the positions of the planets at a given date and time, but they vary wildly in terms of their accuracy. We recommend https://mgvez.github.io/jsorrery/ (https://in-the-sky.org/solarsystem.php is ok too; some others can be really inaccurate)"], [71.0, ["example"], "On the third date, Uranus, Saturn, and Mercury are collinear in this order. Look at the planets corresponding answers. Is there any way you can extract an L from these answers?"], [82.0, ["extraction"], "For each syzygy, the answers corresponding to the two outer planets share exactly one letter in the same position. Take the letter in the corresponding position of the answer of the middle planet."]]