[[0.0, [""], "If you're stuck, try Googling the quoted text in the flavortext. The title should help confirm that you've gotten the right resource."], [1.0, [""], "Yes, there have been lots of topics that have been one-days special. MIT happens to be one of them. If the list is too daunting to search, the MIT One-Day happened in November 2018."], [2.0, ["mit"], "The questions refer to the content of the one-days. For the MIT section in particular, the questions refer to the one-day answers."], [5.0, ["study skills"], "The Study Skills Assessment one-day involved a particular town. These questions refer to the same town."], [10.0, ["change two letters"], "Some of these sections don't directly refer to the particular one-day questions themselves, but they do follow the same format.  Make sure to look at the one-day to determine how to properly format the answers."], [15.0, ["country anagrams", " 44 letters", " 27 letters"], "In that one-day, it was not sufficient to just determine what the things in the parentheses are. Make sure to look at the one-day to determine how to properly format the answers."], [20.0, ["flip a coin"], "This one is a little less obvious what the theme is, particularly since the Smith Note has been lost to history. You might want to look at the questions and answers to try to find a theme here."], [21.0, ["flip a coin"], "Each question is written in such a way that there are two \"obvious\" possibilities, and then including relatively obscure facts to distinguish the two. \"The other side\" refers to the possibility not taken."], [25.0, ["what comes fourth"], "You can answer these questions without seeing the sequences themselves (if you're not logged in), because the answers provided provide a reasonably thorough explanation as to what sequences the questions were about."], [40.0, ["cryptic clues"], "You will need to use the answers for this one."], [41.0, ["cryptic clues"], "The \"nth thing\" refers to the \"nth answer\". You will then need to transform these answers using the corresponding cryptic indicators."], [70.0, ["paradoxes"], "You want to take one letter from each question. Ignore spaces, numbers, and other punctuation."], [100.0, ["write a one day"], "You should submit this answer to get instructions on how to send us the one-day."]]