[[10.0, ["start"], "The goal of this puzzle is to assemble a working C program from the given 53 lines of code. The first thing you need to do is to identify the external resource that gives the correct ordering of the lines. The nature of that resource will indicate what you need to do after that."], [20.0, ["correspond", "note", "piece"], "The correspondence between \"In C\" and the program is based on the pitches of the notes. The lengths of the notes are not relevant. Tied notes and consecutive rests count as one. Some elements of the code (for example, parentheses) are not reflected in the correspondence."], [30.0, ["order", "program", "compile"], "In \"In C\", the segments are played in order, but each may be skipped or repeated any number of times at the performer's discretion. Similarly, in this puzzle you must omit some lines and repeat others to form the final C program. There's no pattern or external correspondence; you just have to work through it step by step. You can assume most lines are used, unless they are invalid, and that lines generally progress the goal of filling in the array; the program doesn't have room to waste on executing useless or redundant instructions."], [40.0, ["line", "repeat", "skip"], "[I don't know how to write a canned hint for this part. Just give them something based on their request and the listing in the solution. Err on the side of giving them more help. You can also use the last part of the previous canned hint if they don't know it already:]\r\n\r\nYou can assume most lines are used, unless they are invalid, and that lines generally progress the goal of filling in the array; the program doesn't have room to waste on executing useless or redundant instructions."], [50.0, ["extract"], "The program sets values in the array F as it runs. There are 22 entries (and one sentinel at F[22]). Lines 49-53 are the final loop, which goes through F and modifies all the values to ones amenable to extraction. The comment on line 46 gives a pattern for the extraction. If you did it right, the final values in F should all be close to integers, and there should be a natural way to read them. If some of the values look invalid, though, then you may need to think a bit more about what that way is."]]