[[0.0, ["start"], "Each level has a single word answer."], [5.0, ["start", " extraction"], "Each of the first four levels' answer enumeration is given by the coins at the end of the level."], [10.0, ["1-1", " wigging out", " gameplay"], "Hold X or Y to run, then press A or B to jump to reach the door."], [10.1, ["1-1", " wigging out", " gameplay"], "Holding the jump button while bouncing on top of a wiggler gives you more height."], [10.5, ["1-1", " wigging out", " extraction"], "The level's title, Wigging Out, clues what you should look at to get letters."], [10.9, ["1-1", " wigging out", " extraction"], "The shape of angry red wigglers spell out letters for the answer to this level."], [20.0, ["1-2", " picture that", " gameplay"], "Use the SMB2 mushroom to dig through clouds (hold down and press X/Y) to proceed through the level."], [20.2, ["1-2", " picture that", " gameplay"], "You can also pick up enemies in the same way as digging through clouds. Hold X or Y to hold on to the enemy, and let go to throw them."], [20.3, ["1-2", " picture that", " gameplay"], "Pick up and hold the banzai bill, jump across to the right, and throw the banzai bill where you see the throw indicator (looks like a C). Then jump on to the banzai bill you just threw to proceed."], [20.4, ["1-2", " picture that", " extraction"], "The areas surrounded by coins are picross/nonogram puzzles."], [20.5, ["1-2", " picture that", " extraction"], "The nonograms each give a picture of something seen in the room with all the question blocks."], [20.6, ["1-2", " picture that"], "Hit the question blocks underneath the four things depicted in the nonograms to get keys to proceed."], [20.7, ["1-2", " picture that", " extraction"], "There's one more nonogram in the pipe before the end."], [20.8, ["1-2", " picture that", " extraction"], "Every nonogram solution also has one or more braille letters."], [20.9, ["1-2", " picture that", " extraction"], "Order the six braille letters by the order of appearance of the five pictures in the level."], [30.0, ["1-3", " luigi", " nothing"], "You can beat the level by doing absolutely nothing."], [30.1, ["1-3", " luigi", " nothing"], "You can do something near the end of the level to find a secret area."], [30.2, ["1-3", " luigi", " nothing"], "Enter the key door at the end of the level, and go in the pipe. Something should be familiar."], [30.3, ["1-3", " luigi", " nothing"], "In the subworld, the area surrounded by coins should look familiar to an area in the main world. Hitting the ? block should sound familiar."], [30.4, ["1-3", " luigi", " nothing"], "You'll need to win by doing a few things. The first thing is hitting the hidden ? block in the main world by pressing jump at the right time."], [30.5, ["1-3", " luigi", " nothing"], "You need to win as Link to proceed right in the key door/subworld."], [30.6, ["1-3", " luigi", " nothing"], "There are a few moments where you'll need to use Link's abilities to prevent taking damage."], [30.7, ["1-3", " luigi", " nothing"], "Jump, shield, swing your sword, and shoot an arrow to get to the key door as Link."], [30.8, ["1-3", " luigi", " nothing"], "Dash through the enemies in the subworld to get a message about how to extract."], [30.9, ["1-3", " luigi", " nothing"], "When you win by doing nothing, you take damage four times. When you win as Link, you add an input during each of those four times. Use those times modulo 26 and convert to letters to get the four letter answer to this level."], [40.0, ["1-4", " boo", " boom", " breakout"], "Break the boos out of Boom Boom's prison by ground pounding see-saws, ground pounding ON/OFF blocks, and running under thwomps."], [40.9, ["1-4", " boo", " boom", " breakout"], "After you free the boos, they spell out the answer behind them in the second last room (and it's the shape they form)."], [50.0, ["1-m", " gobeetle desert", " gameplay"], "The line indicators with a yellow block at the end tell you where to eat shells.\r\n\r\nThe C-shaped indicators tell you where to spit out shells.\r\n\r\nPress X or Y for eating or spitting. Hold X or Y to eat/spit and continue running."], [50.1, ["1-m", " gobeetle desert", " gameplay"], "Press L or R to jump off of Yoshi. You can do this mid-air to reach new heights."], [50.5, ["1-m", " gobeetle desert", " extraction"], "This is the meta level, and you'll need the answers from the first four levels to get the answer out of this level (which is the answer to the puzzle)."], [50.6, ["1-m", " gobeetle desert", " extraction"], "Every time you get a red coin, you extract one letter."], [50.7, ["1-m", " gobeetle desert", " extraction"], "Once you have all red coins, entering the key door tells you what enemies to pay attention to."], [50.8, ["1-m", " gobeetle desert", " extraction"], "Each enemy (Bob-omb, Dry Bones, Piranha Plant, Lakitu) can be associated with an answer in the first four levels."], [50.9, ["1-m", " gobeetle desert", " extraction"], "The number of times a shell interacts with an enemy in each red coin section is the index into the corresponding answer. Order by appearance (or as shown in the key door) to get an eight letter answer."]]