[[0.0, ["READ ME"], "This puzzle may be solvable with partial information, so I'd be happiest if only one of the hints were given at a time, even if they ask for help for multiple images. Up to the hint-giver's discretion though."], [0.1, ["start"], "At first glance, each image may look like one location, but if you look closer, that's not the case."], [30.1, ["image", " picture", " temple", " island", " france", " malaysia"], "While the writing on the temple may give hint at the proper continent, the writing on the van will help narrow it down to the correct country.\r\n\r\nTo pin down the location with the bicycles, you must do some panning and shape matching on google maps after identifying the country."], [30.2, ["image", " picture", " atlapa", " panama", " kenya", " kitui"], "This image splits in two places. Once above the African buildings, and once isolating the Atlapa sign. When in doubt, search any text you see on Google or Google Maps."], [30.3, ["Image", " picture", " market", " bus", " otto's"], "The city visible on the bus has interactive bus route maps that may be helpful, while the logo in the back in the other city may be recognizable to some avid European sports fans."], [30.4, ["image", " picture", " japan", " australia", " quarantine"], "Both locations drive on the same side of the road, and while translation may be the best course of action for one, broader search terms may be best for the other."], [30.5, ["image", " picture", " portugal", " clocktower", " swimming pool", " syria"], "There's a flag for each country in this image. And remember: the locations at the dots, not the camera, are what's important."], [30.6, ["image", " picture", " sun", " skyline", " hecka"], "All the text on the right side of the image is useful, while the left side focuses more on figuring out which city that skyline belongs to."], [30.7, ["image", " picture", " pyramid", " st. louis"], "The interstate is located in a large American city; use the tree line to figure out which.\r\n\r\nThe other location has a pyramid..."], [30.8, ["image", " picture", " memorial", " canada", " thailand"], "The majority of the image is located in Southeast Asia and translating text is not necessary to find the location. The Canadian portion of the image relates to the person on the memorial."], [30.9, ["image", " picture", " chicago", " tower", " copenhagen"], "A tip for many of these pictures is to search any text you see on Google or Google Maps. This is true here for one location, the other can be found using buildings in the background."], [70.0, ["red", " blue", " purple"], "The red dot corresponds to one location and the blue dot corresponds to another location. Use colour theory and the lines to identify what the purple dot signifies."], [90.0, ["instructions"], "The instructions don't seem to match the images at all, but by finding the combined coordinates in each image, the instructions may become much clearer."], [100.0, ["extraction"], "The instructions you've followed after finding the coordinates of the purple dots point to specific letters in specific Photo Spheres/Street View locations. By putting these letters in order, they may help spell out the answer."]]