[[0.0, ["start"], "The puzzle consists of the 9 rooms arranged in a circle, each of which contains a minipuzzle involving sound. Each room can be solved independently."], [10.0, ["start"], "Each room will end up extracting to a single letter."], [50.1, ["room", " letter"], "(this is for the lower room on the left edge)\r\n\r\nThere is a single sound in this room moving around in the shape of a letter. It may be useful to either stand in a single place and hear when the sound passes by you, or try to \"chase\" the sound around the room."], [50.2, ["room", " letter"], "(this is for the upper room on the left edge)\r\n\r\nEach of the noises you hear corresponds to one of the colors red, white, or blue. These form maritime signal flags."], [50.3, ["room", " letter"], "(this is for the left room on the top edge)\r\n\r\nYou'll want to use braille here."], [50.4, ["room", " letter"], "(this is for the middle room on the top edge)\r\n\r\nThis room represents the home page of a certain website."], [50.5, ["room", " letter"], "(this is for the right room on the top edge)\r\n\r\nIn this room, each sound can appear in two possible locations; if you walk to the location a sound is currently at, it will teleport to the other.\r\n\r\nThis lets you draw lines between the pairs of locations."], [50.6, ["room", " letter"], "(this is for the top room on the right edge)\r\n\r\nThis puzzle is a 5x5 grid with a crossword clue being read in each row and column. You can solve the clues and write the answers in a 5x5 crossword, and then take the middle letter (which is the only square you can't walk through in the room)."], [50.7, ["room", " letter"], "(this is for the bottom room on the right edge)\r\n\r\nEach tone (well, 4 of the 5 tones) makes the shape of a letter. The 5th tone makes the shape of an underscore or blank, which indicates a letter you can fill in to make a 5 letter word."], [50.8, ["room", " letter"], "(this is for the middle room on the bottom edge)\r\n\r\nThe sound that plays depends only on which direction you're moving in (there are 7 possible directions).\r\n\r\nYou want to move in such a way that you correctly hear the first ~5 seconds of Never Gonna Give You Up."], [50.9, ["room", " letter"], "(this is for the left room on the bottom edge)\r\n\r\nThis represents a certain board game. All the squares with dings on them share a single letter."], [100.0, ["extract"], "Read the letters in clockwise order, picking an appropriate starting place, to get the final answer."]]