[[0.0, [""], "You will need to download and install VCV Rack: https://vcvrack.com/Rack\r\n\r\n\r\nYou will also need a VCV account in order to install a few third-party plugins. (You can share one account with your teammates, and then if you add a plugin to your account, Rack will install it for everyone logged in with that account.)\r\n\r\n\r\nStart by building the 11 patches shown in VCV Rack."], [20.0, [""], "With one of the VCV Rack patches built and loaded, you should be able to hear synthesizer sounds by typing on your keyboard.\r\n\r\nTry typing sequences of letters and numbers from the snippets at the bottom of the puzzle. You might need to rearrange and assemble the snippets to get something recognizable."], [50.0, [""], "Each of the snippets with a beveled left edge is the start of a melody, and all of the other snippets can be chained after one of those starts to make eleven complete melodies. Each melody can be played on one of the VCV Rack patches to produce a fitting synthesizer timbre for that song."], [70.0, [""], "Identify the song names. There will be one red-outlined snippet in each melody when correctly assembled. Then, treat the position of that snippet in its sequence as an index. (There are some blanks at the very bottom of the puzzle to help with enumeration.)"], [85.0, [""], "You'll need one more third-party VCV Rack plugin. Add it to your account, and add the one module to your Rack patches.\r\n\r\n[If solvers are having trouble getting the correct cluephrase, help them correct mistakes with the snippets, indexing, or song ID.]"], [95.0, [""], "MH Spiro produces two output signals, X and Y. How can you visualize them? (You will need to do something to trigger some special behavior of the Spiro module.)"], [100.0, [""], "Connect the MIDI-CV V/OCT out to the MH Spiro V/OCT in, the MIDI-CV GATE out to the Spiro GATE in, the Spiro X out to Scope X in and the Spiro Y out to \r\nScope Y in. Then, try playing some of the complete melodies you assembled earlier."]]