[[0.0, [""], "Rearrange the trigrams to get clues."], [5.0, [""], "Good job answering the clues! It does seem strange that the trigrams were given as a TXT file though. It really feels like this puzzle should be more extensive than it looks."], [6.0, ["heavier"], "What relates \"extensive\", files, and trigrams?"], [7.0, ["giveaway"], "The title, along with the trigrams and the bare TXT file suggest that file extensions are important. Can we use this, along with the  answers of the clues, in any way?"], [8.0, ["asimov.txt"], "No, the file extension isn't TXT this time. Can you spot any other file extensions in the clue answers?"], [10.0, ["can't open file"], "Unfortunately, it doesn't seem that these files are actually the file type that they're stated to be. However, you can still open them up in a text editor like Notepad to potentially get some traces of what their filetypes really should be."], [11.0, [""], "The file extensions are mixed up among each other. This should help narrow down possibilities greatly."], [20.0, ["aperi.tif", " mov"], "There is one missing trigram, which is the answer to this subpart."], [21.0, ["aperi.tif", " mov"], "There are a few ways to get the missing trigram. It may be helpful to know that every other trigram appears for exactly one frame (that lasts for 1/15th of a second). It may be helpful to either be able to decompose a video file into frames, or a way to precisely pinpoint individual frames in a video, or be able to advance a fixed number of frames in the video, or be able to slow down the video."], [25.0, ["regist.rar", " tif"], "This is a picture of Pokemon Red/Blue. In particular, which town are we in? This is a hint for what to look at next."], [26.0, ["regist.rar", " tif"], "This is a picture of Pallet Town, and as such the palette of the image is relevant. While the image appears to be only in four colors, the image hides more information than that."], [27.0, ["regist.rar", " tif"], "First, look at the palette (color map in GIMP). There are 256 colors, which suggests formatting it in a 16x16 square (if it isn't already shown as such). This message once again applies to the palette."], [28.0, ["regist.rar", " tif", " 0 mod 7"], "Palettes assign a color to every number from 0 through 255, which might help you be able to apply the 0 mod 7 message."], [29.0, ["regist.rar", " tif", " 0 mod 7"], "You'll want to find the particular pixels in the picture represented by palette values that are 0 mod 7. One way you can do this is if you have an image editor that can modify the palette directly, and then modify the relevant indices to some other color."], [30.0, ["kah.lua", " rar"], "You'll want to record the structure of each of the file trees, paying attention to the location of the X (though you can ignore A and B)."], [31.0, ["kah.lua", " rar"], "What thematic connection connects the three surnames Fano, Shannon, and Huffman? Since there are 3 file trees and 3 surnames, you'll want to associate each tree with one of them."], [32.0, ["kah.lua", " rar"], "Fano, Shannon, and Huffman describe three different compression codings. You can read up on them here:\r\n\r\nhttps://en.wikipedia.org/wiki/Huffman_coding\r\n\r\nhttps://en.wikipedia.org/wiki/Shannon%E2%80%93Fano_coding\r\n\r\n\r\nYou'll want to compress the given alphabetic string in each of the ways, which will let you associate a letter with each leaf node."], [35.0, ["post.doc", " lua"], "This is a Lua program where you want to determine the output."], [36.0, ["post.doc", " lua"], "It recursively tries to run through all possible 5x11 binary grids and then checks whether certain conditions are satisfied. Since 2^55 is a large number, this program won't terminate anytime soon, so you'll want to understand what the constraints are and then logic out the solution."], [37.0, ["post.doc", " lua"], "Number the columns 1 through 11 from left to right and similarly number the rows 1 through 5 from top to bottom. Then, for each row, take the sum of the column values of the shaded squares, and vice versa. (This happens to be the same ruleset as the logic puzzle genre Kakurasu.)"], [40.0, ["pyra.mid", " doc"], "Not all of the lines are the same. Some parts have been made harder to read."], [45.0, ["multi.ply", " mid"], "A MIDI editor that can view the notes as well as some meta-information will be helpful for this part."], [50.0, ["asi.mov", " ply"], "It looks like an unassuming black box. Perhaps we should look at what's inside?"], [100.0, ["extract"], "Assemble the trigrams to get a cluephrase for the answer. The ordering is provided by the chain of extensions."]]