[[0.0, [""], "This is a git diff, a file representing a set of changes to apply to a git repository. You will need to locate a significant resource on another website to solve this puzzle. Try Googling any suspicious phrases in the puzzle content."], [20.0, [""], "Ignoring the meta, each hint request consists of exactly three paragraphs. Each paragraph should actually be applied to a different non-meta puzzle. You will often need to try to follow the hint requests on the puzzles they were requested for to understand what the hint requestor was trying to do in each step."], [40.0, [""], "The number and order of steps is always preserved, and all three steps originally applied to one puzzle are assigned to different puzzles: the first step a solver tried should be the first step on another puzzle, the second step should be the second step on a third puzzle, and the third step should be the third step on a fourth puzzle."], [50.0, [""], "(The puzzle does not divide neatly into subpuzzles, so mix and match as needed.)\r\n\r\nUse aspects of the puzzles mentioned in the hint request steps to assign them to puzzles on which they apply equally well or better. For example, the very first step in the puzzle, the one starting \"I have solutions for most of the subpuzzles from a friend\", must apply to a different puzzle that has subpuzzles with solutions."], [51.0, [""], "Two of the 18 steps conspicuously mention a grid. Both should be assigned to the puzzle that most obviously features a grid."], [52.0, [""], "There's a bit of a divide between puzzles that are very number-heavy and steps that operate heavily on numbers, and puzzles and steps that aren't. This should help you reassign some of the first steps to other puzzles."], [53.0, [""], "The puzzle title that \"clues\" the famous video game technically clues its subtitle, but that's the name by which the video game is most uniquely known."], [54.0, [""], "The first step in the Championship hint request sorts clues in reverse by length and should be assigned to Ambiguity."], [55.0, [""], "The second step in Championship's hint request conspicuously references a \"? in the middle\" and should be assigned to a puzzle with such a question mark."], [56.0, [""], "Only a few puzzles include clearly boxed content or discrete blanks on the bottom, which means there are few possibilities for the hint request steps that reference such aspects of puzzles."], [100.0, [""], "When the assignment is complete, solvers should arrive at a plausible answer on every puzzle that matches the description of what the requestor wants at the end of their third paragraph, and that also works with the final meta. Follow the hint request on the meta to extract the answer."]]