[[0.0, ["start", " MIT"], "This puzzle isn't what it looks like. Can you think of other interpretations of the instructions that don't involve walking around MIT campus? \"Start somewhere at MIT\" is accurate, but a lot of the descriptions, e.g. \"Course 16 lab\" take some liberty. The title is a clue."], [10.0, ["start", " heavy"], "The \"Train\" in the title in particular is a clue to what is going on here - you are running around as a train. Start at Kendall/MIT and take the red line at the beginning of the first instruction. You'll need to look at both the subway map and the real map to solve the clues."], [20.0, ["xkcd", " green line extension", " lechmere"], "The instructions do stop making sense after the first set of four, but they can be made to make sense! The letters extracted from the first four clues spell a clue that helps you figure out how to traverse the rest of the clues. Is there any material from the source referenced by that clue, that is related to the theme of this puzzle?"], [40.0, ["xkcd", " heavy"], "The first four letters extract XKCD. You'll need to use a subway map drawn by xkcd in order to solve the rest of the puzzle."], [50.0, ["misc"], "Some correspondences that might help: course 16 labs are airports. The most popular room on campus or in an area of campus is the station that has the most daily subway ridership. Campus is North America, and an area of campus is a subway system. \"Seems\" refers to things true in the real world but not the xkcd map. Be careful when you enter los angeles, the line colors on the xkcd map don't match real life and some of the maps you'll find of the system don't include the right line at all."], [80.0, ["music", " extract"], "All your letters are between A and G, but this puzzle does not involve interpreting them as music. Look at the bottom of the puzzle, where there is one blank of each color. Can you extract one character from each color somehow? Both where you went on your journey and the letters are relevant."], [95.0, ["extract", " heavy"], "Each color should extract a contiguous series of letters from A up to something. You can use these letters to tell you how to draw a symbol on the map."], [100.0, ["SW", " numbers"], "Your final extraction will not extract a recognizable 6 letter phrase, but rather a 6 character code for a color of paint. The first 2 symbols are letters and the next four are numbers."]]