[[0.0, ["rules"], "This is the game Baba Is You, but there are four players sharing a game state. However, only YOU needs to reach the flag to win."], [30.1, ["level 3", " ice"], "First make ICE IS HOT and ICE IS MELT to eliminate the ice."], [30.2, ["level 3", " wind"], "Player 3 should make DOOR IS SHUT."], [30.3, ["level 3", " two"], "The UFO and CRYSTAL can cooperate to create UFO IS TWO and UFO IS OPEN simultaneously."], [30.4, ["level 3", " boat"], "Once WATER IS STOP is cancelled, the boat can make LOVE IS WIN by pushing the sentence WATER IS SINK into the water, causing one of the water cells to disappear."], [40.1, ["level 4"], "The level is interconnected. Try pushing a block onto the dot to see what happens."], [40.2, ["level 4"], "The level is interconnected, so player 3 can push the word IS into player 1's screen."], [50.1, ["level 5"], "First make KEY IS HOT and burn fences, then make KEKE IS HOT to burn more fences."], [50.2, ["level 5"], "You'll need to make FENCE IS OPEN and WATER IS SHUT followed by KEY IS OPEN and DOOR IS SHUT."], [60.1, ["level 6"], "Start by pushing a single wall cell onto the northern flag."], [60.2, ["level 6"], "To extract the tiles, have player 1 stand in the dot and player 2 push the tiles to them."], [60.3, ["level 6"], "You'll want destroy the rock immediately to the right of TILE. This will require players 1, 2, 4 to all cooperate."], [70.1, ["level 7"], "Once EMPTY IS PUSH, the tiles in player 3's screen should be aligned so that Baba can make FLAG IS WIN. You will also need to cancel TEXT IS MELT."], [70.2, ["level 7"], "Once EMPTY IS PUSH, the airplanes need to be aligned on the same row to cancel TEXT IS MELT."], [70.3, ["level 7"], "Once EMPTY IS PUSH and FLAG IS WIN, the crab should be on the same row as the flag."], [80.1, ["level 8"], "This level uses the same idea as the famous \"Prison\" level in the original game."], [90.0, ["extraction", " flags", " semaphore", " braille", " dot"], "For extraction, try zooming and looking at the entire level all together, and pay attention the dots and flags."], [100.0, ["extraction"], "To get the last word of the answer, notice the row of eight objects all have four-letter names. How can you index into them?"]]