[[0.0, ["title", "start", "begin"], "The title hints at an action you might take, outside of the puzzle, to get started with it."], [1.0, ["start", "begin"], "You should try texting the phone number in the title!"], [2.5, ["hourglass", "medal"], "The message you get with the hourglasses is telling you how many seconds (🥈s) you have to wait before you can submit another guess. It's not a clue."], [5.0, ["100"], "You've got the right idea, this is indeed a multiplication question. But the question was presented to you as a text message in only emoji, so how should you reply?"], [10.0, ["rock.paper", "scissors", "lizard"], "Each emoji in this clue represents an item in a well-known (well, somewhat well-known) ordered set. You're certainly familiar with the variant with just the first three items; you may not have heard of the variant with lizard and one more thing. You're looking for the item to replace the question mark."], [15.0, ["happy", "smile", "sad", "worried", "vomit"], "This is another well-known set. Maybe thinking about 2018 will help you. That third emoji represents disgust."], [20.0, ["bread", "lettuce", "meat", "cheese"], "What do you get when you put lettuce, meat and cheese on bread?"], [25.0, ["bunny", "rabbit", "ears"], "There's some crazy emojis out there. This clue is about one you may not have heard of. Try interpreting the third emoji and the fourth/fifth emoji in the clue as a phrase."], [30.0, ["moon"], "The dash should be interpreted as \"subtracting\" one shape from the other. What result do you get?"], [35.0, ["flag"], "Write down all the countries on the list. Or type them out. See if you notice anything they have in common.\r\n\r\nIf not, try googling them all together once you've identified enough of them.\r\n\r\nWhat is missing?"], [40.0, ["fruit", " kiwi", " pineapple", " coconut"], "This is a system of equations where the variables are fruits. Each line is a separate equation. What is the value of coconut?"], [45.0, ["underconstrained", "strawberry", "apple", "grape", "banana", "equations"], "This is another system of equations, but with a twist. There are multiple possible solutions in terms of numbers, but there's something else that apple is equal to."], [45.1, ["underconstrained", "strawberry", "apple", "grape", "banana", "equations"], "This is another system of equations, but with a twist. There are multiple possible solutions in terms of raw numbers, but there is exactly one other fruit that apple must be equal to."], [50.0, ["bee", "storm"], "The number 5 is an enumeration; that is to say, the word you're looking for is five letters long."], [50.1, ["bee", "rain", "storm"], "If we were less tricky, we might have used the emoji 🅱️ instead of 🐝. In 🌧️, you don't care about the cloud, just what it's dropping."], [55.0, ["mouse", "rat", "mice", "rats", "back"], "As with the previous clue, the (4) is an enumeration indicating the number of letters in the answer.\r\n\r\nThose are rats, not mice."], [55.1, ["rats", "back"], "🔙 is indicating a transformation you should perform on the word RATS."], [60.0, ["carrot", "comet.shuffle"], "Each of 🔚☄️ and 🔀🥕 should be parsed independently, then you should put them together to make the answer."], [65.0, ["clocks"], "These clocks represent letters using a common puzzlehunt encoding."], [70.0, ["bicycle", "candy", "moon", "point", "sparkle", "1982"], "This is an extremely abbreviated plot summary of a movie released in 1982."], [75.0, ["eye", "tape", "tv", "calendar", "skull"], "The correct interpretation of the calendar emoji is \"days\". Like the last one, this clue is the plot summary of a 2002 movie."], [80.0, ["arrows", "arrow"], "You might find graph paper helpful for this part."], [100.0, ["clap", "phone", "japan"], "Good job! 👏👏👏 You're finished. Call in 📞➡️ the five letter answer (on the puzzle page)."]]