[[0.0, ["very start"], "Get the ClueKeeper app on your phone, type in the hunt code GREENTEE, and get the hunt. You will unlock the first puzzle, which contains an augmented reality extension Zappar. You can point the Zappar on the T-shirt (or the image we posted online) and it will display some text onto the windows of the Green Building."], [5.0, [""], "The letters appear on the Green Building windows. However, the vines in its reflection  in the water seems to be trying to tell us something. How can we use these vines to trace out paths of letters and numbers?"], [20.0, [""], "Reflect the vines. Each vine will pass over some letters, which should let you complete the remaining parts of the words. The numbers are numbered consecutively from 1 to 14, so read the letters that should be in these spaces."], [25.0, ["christmas carol"], "Correct, CHRISTMAS CAROL is the correct answer to the first puzzle in the ClueKeeper hunt. Enter that answer into ClueKeeper to get the next puzzle."], [35.0, ["level 2", " blank spaces"], "Starting with the second level, some spaces are blank. These work exactly the same as the first level, only that these blank spaces don't contribute to extraction. Filling out the words will require understanding a theme. (tangentially relevant to the rest of the puzzle)"], [50.0, ["level 2 theme"], "The second level is about MBTA T stations."], [70.0, ["level 3 theme"], "The third level is about words that, when a \"T\" is added in front, results in a reasonably common phrase or thing."], [90.0, ["level 4 theme"], "The fourth level is about words that can have a -TY added at an end (TY being phonetically pronounced like a T)."], [95.0, ["extract"], "Now, it's time to use the answers that we got from the four levels, in order to get the answer. You won't need to use the solved letter grids from the previous levels, but the T-shirt will still be useful."], [97.0, ["extract"], "Each answer is two words long. There are four answers, so that makes eight words. Is there anything else in the T-shirt that has eight things?"], [98.0, ["extract", " heavy"], "There are eight words in our answers, and eight vines. They happen to match up in lengths as well. Rearrange these words on the vines such the letters are consistent at intersections. Finally, you'll want to look at the grid for final extraction."], [100.0, ["extract", " heavy"], "After rearranging the words such that each vine spells out one word, read down the middle column."]]