[[0.0, [""], "You'll need to first figure out what the rebuses mean before you can use the proverbs. Maybe the person who gave you the rebuses could offer some clues."], [1.0, ["exchange"], "What about the rebuses could make them particularly \"radical\" or \"simple\"?"], [2.0, ["exchange", " radical", " simple"], "The rebuses clue Chinese characters."], [10.0, ["chinese", " radicals", " lookup", " 照", " 保"], "Not all the rebus components are common radicals. Google Translate's handwriting recognition might be a useful tool for identifying the remaining characters."], [20.0, ["肉"], "The \"meat\" radical looks different from the word for \"meat\"."], [30.0, ["half"], "The Chinese word for \"half\" is 半. It might not be a bona fide radical, but try making words with it anyway! Google Translate's handwriting recognition might be a useful tool here."], [40.0, ["web"], "The web rebus is a tricky one. The Chinese character for \"web\" is 网, try making a word with it anyway and see if anything comes up. Google Translate's handwriting recognition might be a useful tool here. The proverbs might also help your search."], [50.0, ["嚨", " 剛"], "There are multiple Chinese scripts, are you using the right one? According to the flavortext, these rebuses look particularly simple."], [70.0, ["matched"], "The matching goes deeper than just \"the rebus clues a word in its corresponding proverb\", but how? It doesn't look like the meanings of neither the proverbs nor the Chinese characters are important any more."], [70.0, ["matched", " 成语"], "成语 isn't relevant to this puzzle. In fact, the meanings of neither the proverbs nor the Chinese characters are important any more. Could you find any more commonalities between the clued Chinese characters and their matching proverbs?"], [75.0, ["matched", " stuck"], "Count everything!"], [80.0, ["matched", " counted", " words", " stuck"], "Count the number of strokes in each character."], [87.0, ["extract", " strokes", " index"], "The puzzle doesn't seem to give an ordering for the strokes. How else could you put a bunch of strokes together? Don't worry, you don't need to \"anagram\" the strokes to solve this puzzle. Perhaps putting them back into a \"stack\" might help you see through to the final answer."], [99.0, ["extract", " strokes", " stack"], "Overlay the strokes on top of each other in their original positions to extract a new character."], [100.0, ["肤"], "You've solved the puzzle! We need an answer in English, though."]]