[[0.0, [""], "(This puzzle probably isn't amenable to canned hints. Give hints to teams based on their progress.)"], [0.1, [""], "birthday: This subpuzzle is isomorphic to the original Cheryl's birthday problem. If you understand the solution to that problem (which is easy to find online), you should be able to solve this subpuzzle."], [0.2, [""], "The first few steps of this puzzle are similar to deductions made in the original Cheryl's birthday problem.\r\n\r\nWhen Albert says \"We could continue this conversation indefinitely\", that should narrow the set of possible cells (from your perspective) from 15 to 10."], [0.3, [""], "d1, d2, d3: The first and third statements together produce a fairly strong implication about Cheryl's number, after which you should be able to produce a table that the remaining statements can be applied manageably to."], [0.4, [""], "div1 and div2: The table of possible number pairs given to Albert and Bernard is fairly small. You can probably make the full table and perform deductions on it."], [0.5, [""], "edges: The most useful first step is likely to label all equivalence classes of edges that cannot be distinguished by connectivity information alone. For example, the two edges that connect a vertex of degree 1 to a vertex of degree 3 near the top-left are indistinguishable. You should have 8 nontrivial equivalence classes, six of size 2 and two of size 4. The statements can be interpreted as assertions involving these equivalence classes.\r\n\r\n(this is a bad hint please fix it)"], [0.6, [""], "nonogram: oh god why"], [0.7, [""], "states: Though intimidating, the sequence of statements makes the most sense if you perform it as steps on a large 19x19 table with 50 filled-in squares and eliminate rows/columns."], [0.8, [""], "Sum and product: For the first step, try describing the mathematical property corresponding to whether Bernard's number enables him to know Albert's number right away. This lets you describe the set of numbers that Albert's number can be. Large numbers can be eliminated by relying on a certain conjecture that's been empirically verified for many numbers. This subpuzzle also isn't too hard to short-circuit; Albert and Bernard's numbers are very small and uniquely determined by the puzzle, so once you find a pair that works you can trust that they are the right numbers."], [0.9, [""], "whether: Consider the sequence of statements that starts:\r\n\r\n- W(0): “Albert knows Bernard’s number.”\r\n- W(1): “Bernard knows whether Albert knows Bernard’s number.”\r\n- W(2): “Albert knows whether Bernard knows whether Albert knows Bernard’s number.”\r\n\r\nTry writing a recurrence that describes the set of possibilities implied by each statement. If you make a table it should make a pretty fractal pattern."], [0.91, [""], "whisper: Try making a table where the columns are all of Albert's possible states of knowledge after the first statement (there are nine). Then figure out which of them are states that tell Albert whether Bernard's number is larger."]]