[[0.0, ["no puzzle"], "If the team has not received the physical puzzle but ordered it, go to the #web channel and ask that someone unlock the virtual version of the puzzle for that team. When someone has done so, resolve the hint request."], [15.0, ["no string provided"], "Hello,\r\n\r\nThank you for your hint request. Could you be more specific about why you're contacting us? \r\n\r\nSincerely,\r\n✈﻿✈﻿✈ Galactic Trendsetters ✈﻿✈﻿✈ Command"], [20.0, ["they indicate that they got USE BRAND and understand it means Hint Water/to ask for a hint"], "Hello,\r\n\r\nThank you for your hint request. From the information you've provided, we think the step you're missing is to remove the second, fifth and sixth letters, and to replace the last letter with T.\r\n\r\nSincerely,\r\nArnoldTheRhino\r\n✈﻿✈﻿✈ Galactic Trendsetters ✈﻿✈﻿✈ Command"], [30.0, ["ANOTHER HINT"], "Hello,\r\n\r\nThank you for your hint request. From the information you've provided we think the step you're missing is to swap the second and third letters, then shift the final four letters to the front, then finally remove letters from or add a prefix of the word GROWING to the end so that you have exactly 8 letters.\r\n\r\nSincerely,\r\nGiantPanda\r\n✈﻿✈﻿✈ Galactic Trendsetters ✈﻿✈﻿✈ Command"], [40.0, ["AND AGAIN"], "Hello,\r\n\r\nThank you for your hint request. From the information you've provided we think the step you're missing is to first increment the third letter by 2 and move it to the beginning, then move another letter from what you have to the second position to make the first three letters form a word, then finally change the last letter to an E.\r\n\r\nSincerely,\r\nNtaiNuoy\r\n✈﻿✈﻿✈ Galactic Trendsetters ✈﻿✈﻿✈ Command"], [50.0, ["CONTINUE"], "Hello,\r\n\r\nThank you for your hint request. From the information you've provided we think the step you're missing is to add up the values of all the letters (A=1, B=2, ...), add 1 to that, then remove all the letters that divide the result.\r\n\r\nSincerely,\r\nKBEZEL PGMO CIFNDG\r\n✈﻿✈﻿✈ Galactic Trendsetters ✈﻿✈﻿✈ Command"], [60.0, ["KEEP GOING"], "Hello,\r\n\r\nThank you for your hint request. From the information you've provided we think the step you're missing is to change all Ts into Os.\r\n\r\nSincerely,\r\nTneMtre\r\n✈﻿✈﻿✈ Galactic Trendsetters ✈﻿✈﻿✈ Command"], [70.0, ["ONE MORE"], "Hello,\r\n\r\nThank you for your hint request. From the information you've provided we think the step you're missing is to Caesar Shift by some amount.\r\n\r\nSincerely,\r\nOcvondo\r\n✈﻿✈﻿✈ Galactic Trendsetters ✈﻿✈﻿✈ Command"], [71.0, ["THATS IT"], "Hello, \r\n\r\nThank you for your hint request. You're right, THAT'S IT. I'm surprised you needed a hint to understand that. \r\n\r\nSincerely, \r\n✈﻿✈﻿✈ Galactic Trendsetters ✈﻿✈﻿✈ Command"]]