[[0.0, ["start"], "Each of these sets of trigrams rearranges to a clue. You may want to start by looking at unusual trigrams or long words."], [10.0, ["help"], "The first set rearranges to DUR ING HIS SPA NOF FIF TYO RSO YEA RSH EMA DEA MAR KON ABS URD ISM."], [60.0, ["countries"], "The answers to all the clues have something in common. It's not something direct, but something you'll have to associate to get to."], [61.0, ["countries", " easier"], "The answers to all the clues have something in common. It's not something direct, but something you'll have to associate to get to.\r\n\r\nIn particular, you'll find that there are 7 things, each of which is associated with a set of answers. For example, what do [give a few from the same country they have] have in common?"], [62.0, ["countries", " easiest"], "Each of the answers is associated with one of these countries:\r\n\r\nUK, France, Germany, Turkey, Russia, Italy, Austria\r\n\r\nWhat do they have in common?"], [80.0, ["diplomacy"], "The fact that the trigrams are trigrams and that they are out of order is relevant. You'll need to find a reference involving the seven countries before you can properly interpret the data you have and finish the puzzle."], [81.0, ["diplomacy", " easier"], "These are the seven countries in the board game Diplomacy."], [90.0, ["diplomacy", " order"], "You'll need to interpret each of these disorders as an order, making one full set of orders. Knowing the rules of Diplomacy will help."], [95.0, ["order resolution"], "If you're not familiar with Diplomacy, we recommend reading the rules of order resolution very carefully - it's easy to get confused about them. You can use jDip or the Backstabbr sandbox mode if you're having trouble evaluating it manually.\r\n\r\nWhen you're done, there will be seven places where someone is displaced."], [100.0, ["extract"], "Order the seven sites of a displacement using a cycle of which country displaced which other country. Then fill it into the seven blanks at the bottom."]]