[[0.0, ["start", " begin"], "These images are of different zoom levels, and some of them might be easier to identify than you think. Try zooming out all the way on a map of the U.S. and turning off labels."], [20.0, ["small", " zoom"], "Many of these images can be found inside of other images, but you'll need to locate the bigger image on a map before you can zoom in to the smaller one."], [30.0, ["star"], "The five stars represent the five points at the smallest scale. The other images zoom into these five points."], [45.0, [""], "Now that you have the zoom-in order to get to each of these places, you'll need to do something else on the puzzle page itself to figure out what to do next. What haven't you used yet?"], [50.0, [""], "You haven't used the positioning of the images on the page. Try drawing a line from the outermost image to the innermost image in each zoom-in set."], [55.0, ["what3"], "The letters spelled out by the paths between the images in general left-to-right order, WHAT3, are intended to clue the next step."], [65.0, ["what3words"], "You'll need to use the website clued by the paths in combination with the locations you have to find what to do next."], [80.0, ["what3words", "dots", "vague", "rips", "vest", "stuff", "exile", "tube", "wings", "quilt"], "The fact that the W3W codes for the 5 different places share words is relevant. You'll need to use the 3x3 grid at the bottom of the puzzle now."], [87.0, ["dots", "vague", "rips", "vest", "stuff", "exile", "tube", "wings", "quilt"], "Place the 9 words into the 3x3 grid such that all the locations you have can be read on a horizontal, vertical, or diagonal line."], [88.0, ["dots", " vague", " rips", " vest", " stuff", " exile", " tube", " wings", " quilt"], "There are 8 possible ways to read off 3 words in a line (3 horizontal, 3 vertical, and 2 diagonal), and we've seen 5 of them. What about the remaining 3?"], [100.0, ["extract", "clover", "finish", "horizontal", "vertical", "cambridge"], "All three of the locations you've gotten from the 3x3 word square have something in common, and that something is three words long. It might help to look at the locations on Google Maps or Street View."]]