[[0.0, ["start"], "Reading the first letters of each of the puzzle answers might help get you started."], [1.0, ["start"], "The message \"DECODE EACH PUZZLE\" indicates that you should look at the answers for each of the five types of puzzles separately. Each of these five types will extract to a new message."], [21.0, ["unchained", " hint"], "All of the answers to Unchained puzzles have even length. See if you can notice any peculiarities about the letters appearing in the Unchained answers (and why even length might matter)."], [22.0, ["unchained", " giveaway"], "Look at the middle bigram of each of the Unchained answers."], [40.0, ["cafe", " hint"], "Every other Cafe Five answer appears to be significantly longer than its surrounding answers."], [41.0, ["cafe", " giveaway"], "You can almost form every other Cafe Five answer by anagramming its two surrounding answers. What letter is left unused?"], [60.0, ["library", " hint"], "Look at the lengths of the Library of Images answers, starting from the beginning few puzzles."], [61.0, ["library", " giveaway"], "The lengths of the Library of Images answers almost produce the digits of pi. Where do they differ? (Hint: some digits of pi are not the length of any answer in this Mystery Hunt)."], [80.0, ["myows", " hint"], "Look at the starting letters of the Make Your Own Word Search answers."], [81.0, ["myows", " compass"], "The majority of the answers to Make Your Own Word Search puzzles start with a compass direction. What can you do with a list of directions?"], [82.0, ["myows", " giveaway"], "The first letter (or first two letters) of most of the Make Your Own Word Search puzzles form compass directions. Follow these directions to draw out letters. Answers that do not begin with a compass direction separate the different letters."], [90.0, ["simulator", " hint"], "Look at the first letters of the Infinite Corridor Simulator puzzles. Do you recognize this sequence of letters from anywhere?"], [91.0, ["simulator", " giveaway"], "The first letters of the Infinite Corridor Simulator answers reproduce the Infinite Corridor Simulator answers, with the caveat that some letters are missing. Read the letters that are missing."], [95.0, ["extraction", " hint"], "Each message is of the form \"Nth X\". Each X is a digit between 0-9."], [96.0, ["extraction", " hint"], "Can you get a five-digit number from the messages you've extracted from the subpuzzles? What can you do with a five-digit number?"], [100.0, ["extraction", " giveaway"], "Go to the Puzzle at the five-digit number indicated by the subpuzzle messages. The answer to this puzzle is the answer to the Infinite Corridor Simulator puzzle."]]